; domain
;; Transport sequential
;;

(define (domain transport)
  (:requirements :typing :action-costs)
  (:types
        location target locatable - object
        vehicle package - locatable
        capacity-number - object
  )

  (:predicates 
     (road ?l1 ?l2 - location)
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - capacity-number)
     (capacity-predecessor ?s1 ?s2 - capacity-number)
  )

  (:functions
     (road-length ?l1 ?l2 - location) - number
     (total-cost) - number
  )

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        (road ?l1 ?l2)
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
        (increase (total-cost) (road-length ?l1 ?l2))
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
        (increase (total-cost) 1)
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
        (increase (total-cost) 1)
      )
  )

)

; problem
; Transport two-cities-sequential-6nodes-1000size-3degree-100mindistance-3trucks-4packages-800seed

(define (problem transport-two-cities-sequential-6nodes-1000size-3degree-100mindistance-3trucks-4packages-800seed)
 (:domain transport)
 (:objects
  city-1-loc-1 - location
  city-2-loc-1 - location
  city-1-loc-2 - location
  city-2-loc-2 - location
  city-1-loc-3 - location
  city-2-loc-3 - location
  city-1-loc-4 - location
  city-2-loc-4 - location
  city-1-loc-5 - location
  city-2-loc-5 - location
  city-1-loc-6 - location
  city-2-loc-6 - location
  truck-1 - vehicle
  truck-2 - vehicle
  truck-3 - vehicle
  package-1 - package
  package-2 - package
  package-3 - package
  package-4 - package
  capacity-0 - capacity-number
  capacity-1 - capacity-number
  capacity-2 - capacity-number
  capacity-3 - capacity-number
  capacity-4 - capacity-number
 )
 (:init
  (= (total-cost) 0)
  (capacity-predecessor capacity-0 capacity-1)
  (capacity-predecessor capacity-1 capacity-2)
  (capacity-predecessor capacity-2 capacity-3)
  (capacity-predecessor capacity-3 capacity-4)
  ; 972,605 -> 687,508
  (road city-1-loc-2 city-1-loc-1)
  (= (road-length city-1-loc-2 city-1-loc-1) 31)
  ; 687,508 -> 972,605
  (road city-1-loc-1 city-1-loc-2)
  (= (road-length city-1-loc-1 city-1-loc-2) 31)
  ; 463,795 -> 687,508
  (road city-1-loc-4 city-1-loc-1)
  (= (road-length city-1-loc-4 city-1-loc-1) 37)
  ; 687,508 -> 463,795
  (road city-1-loc-1 city-1-loc-4)
  (= (road-length city-1-loc-1 city-1-loc-4) 37)
  ; 523,938 -> 687,508
  (road city-1-loc-5 city-1-loc-1)
  (= (road-length city-1-loc-5 city-1-loc-1) 46)
  ; 687,508 -> 523,938
  (road city-1-loc-1 city-1-loc-5)
  (= (road-length city-1-loc-1 city-1-loc-5) 46)
  ; 523,938 -> 463,795
  (road city-1-loc-5 city-1-loc-4)
  (= (road-length city-1-loc-5 city-1-loc-4) 16)
  ; 463,795 -> 523,938
  (road city-1-loc-4 city-1-loc-5)
  (= (road-length city-1-loc-4 city-1-loc-5) 16)
  ; 321,721 -> 687,508
  (road city-1-loc-6 city-1-loc-1)
  (= (road-length city-1-loc-6 city-1-loc-1) 43)
  ; 687,508 -> 321,721
  (road city-1-loc-1 city-1-loc-6)
  (= (road-length city-1-loc-1 city-1-loc-6) 43)
  ; 321,721 -> 48,484
  (road city-1-loc-6 city-1-loc-3)
  (= (road-length city-1-loc-6 city-1-loc-3) 37)
  ; 48,484 -> 321,721
  (road city-1-loc-3 city-1-loc-6)
  (= (road-length city-1-loc-3 city-1-loc-6) 37)
  ; 321,721 -> 463,795
  (road city-1-loc-6 city-1-loc-4)
  (= (road-length city-1-loc-6 city-1-loc-4) 16)
  ; 463,795 -> 321,721
  (road city-1-loc-4 city-1-loc-6)
  (= (road-length city-1-loc-4 city-1-loc-6) 16)
  ; 321,721 -> 523,938
  (road city-1-loc-6 city-1-loc-5)
  (= (road-length city-1-loc-6 city-1-loc-5) 30)
  ; 523,938 -> 321,721
  (road city-1-loc-5 city-1-loc-6)
  (= (road-length city-1-loc-5 city-1-loc-6) 30)
  ; 2533,255 -> 2559,658
  (road city-2-loc-2 city-2-loc-1)
  (= (road-length city-2-loc-2 city-2-loc-1) 41)
  ; 2559,658 -> 2533,255
  (road city-2-loc-1 city-2-loc-2)
  (= (road-length city-2-loc-1 city-2-loc-2) 41)
  ; 2441,616 -> 2559,658
  (road city-2-loc-3 city-2-loc-1)
  (= (road-length city-2-loc-3 city-2-loc-1) 13)
  ; 2559,658 -> 2441,616
  (road city-2-loc-1 city-2-loc-3)
  (= (road-length city-2-loc-1 city-2-loc-3) 13)
  ; 2441,616 -> 2533,255
  (road city-2-loc-3 city-2-loc-2)
  (= (road-length city-2-loc-3 city-2-loc-2) 38)
  ; 2533,255 -> 2441,616
  (road city-2-loc-2 city-2-loc-3)
  (= (road-length city-2-loc-2 city-2-loc-3) 38)
  ; 2793,700 -> 2559,658
  (road city-2-loc-4 city-2-loc-1)
  (= (road-length city-2-loc-4 city-2-loc-1) 24)
  ; 2559,658 -> 2793,700
  (road city-2-loc-1 city-2-loc-4)
  (= (road-length city-2-loc-1 city-2-loc-4) 24)
  ; 2793,700 -> 2441,616
  (road city-2-loc-4 city-2-loc-3)
  (= (road-length city-2-loc-4 city-2-loc-3) 37)
  ; 2441,616 -> 2793,700
  (road city-2-loc-3 city-2-loc-4)
  (= (road-length city-2-loc-3 city-2-loc-4) 37)
  ; 2676,334 -> 2559,658
  (road city-2-loc-5 city-2-loc-1)
  (= (road-length city-2-loc-5 city-2-loc-1) 35)
  ; 2559,658 -> 2676,334
  (road city-2-loc-1 city-2-loc-5)
  (= (road-length city-2-loc-1 city-2-loc-5) 35)
  ; 2676,334 -> 2533,255
  (road city-2-loc-5 city-2-loc-2)
  (= (road-length city-2-loc-5 city-2-loc-2) 17)
  ; 2533,255 -> 2676,334
  (road city-2-loc-2 city-2-loc-5)
  (= (road-length city-2-loc-2 city-2-loc-5) 17)
  ; 2676,334 -> 2441,616
  (road city-2-loc-5 city-2-loc-3)
  (= (road-length city-2-loc-5 city-2-loc-3) 37)
  ; 2441,616 -> 2676,334
  (road city-2-loc-3 city-2-loc-5)
  (= (road-length city-2-loc-3 city-2-loc-5) 37)
  ; 2676,334 -> 2793,700
  (road city-2-loc-5 city-2-loc-4)
  (= (road-length city-2-loc-5 city-2-loc-4) 39)
  ; 2793,700 -> 2676,334
  (road city-2-loc-4 city-2-loc-5)
  (= (road-length city-2-loc-4 city-2-loc-5) 39)
  ; 2289,266 -> 2559,658
  (road city-2-loc-6 city-2-loc-1)
  (= (road-length city-2-loc-6 city-2-loc-1) 48)
  ; 2559,658 -> 2289,266
  (road city-2-loc-1 city-2-loc-6)
  (= (road-length city-2-loc-1 city-2-loc-6) 48)
  ; 2289,266 -> 2533,255
  (road city-2-loc-6 city-2-loc-2)
  (= (road-length city-2-loc-6 city-2-loc-2) 25)
  ; 2533,255 -> 2289,266
  (road city-2-loc-2 city-2-loc-6)
  (= (road-length city-2-loc-2 city-2-loc-6) 25)
  ; 2289,266 -> 2441,616
  (road city-2-loc-6 city-2-loc-3)
  (= (road-length city-2-loc-6 city-2-loc-3) 39)
  ; 2441,616 -> 2289,266
  (road city-2-loc-3 city-2-loc-6)
  (= (road-length city-2-loc-3 city-2-loc-6) 39)
  ; 2289,266 -> 2676,334
  (road city-2-loc-6 city-2-loc-5)
  (= (road-length city-2-loc-6 city-2-loc-5) 40)
  ; 2676,334 -> 2289,266
  (road city-2-loc-5 city-2-loc-6)
  (= (road-length city-2-loc-5 city-2-loc-6) 40)
  ; 972,605 <-> 2289,266
  (road city-1-loc-2 city-2-loc-6)
  (= (road-length city-1-loc-2 city-2-loc-6) 136)
  (road city-2-loc-6 city-1-loc-2)
  (= (road-length city-2-loc-6 city-1-loc-2) 136)
  (at package-1 city-1-loc-1)
  (at package-2 city-1-loc-6)
  (at package-3 city-1-loc-5)
  (at package-4 city-1-loc-4)
  (at truck-1 city-2-loc-6)
  (capacity truck-1 capacity-4)
  (at truck-2 city-2-loc-4)
  (capacity truck-2 capacity-4)
  (at truck-3 city-2-loc-4)
  (capacity truck-3 capacity-4)
 )
 (:goal (and
  (at package-1 city-2-loc-4)
  (at package-2 city-2-loc-5)
  (at package-3 city-2-loc-2)
  (at package-4 city-2-loc-1)
 ))
 (:metric minimize (total-cost))
)

; plan
1. (drive truck-1 city-2-loc-6 city-1-loc-2)
   deleted: (at truck-1 city-2-loc-6)
   added: (at truck-1 city-1-loc-2)
   goals met: 0 of 4
2. (drive truck-1 city-1-loc-2 city-1-loc-1)
   deleted: (at truck-1 city-1-loc-2)
   added: (at truck-1 city-1-loc-1)
   goals met: 0 of 4
3. (pick-up truck-1 city-1-loc-1 package-1 capacity-3 capacity-4)
   deleted: (at package-1 city-1-loc-1) (capacity truck-1 capacity-4)
   added: (in package-1 truck-1) (capacity truck-1 capacity-3)
   goals met: 0 of 4
4. (drive truck-1 city-1-loc-1 city-1-loc-6)
   deleted: (at truck-1 city-1-loc-1)
   added: (at truck-1 city-1-loc-6)
   goals met: 0 of 4
5. (pick-up truck-1 city-1-loc-6 package-2 capacity-2 capacity-3)
   deleted: (at package-2 city-1-loc-6) (capacity truck-1 capacity-3)
   added: (in package-2 truck-1) (capacity truck-1 capacity-2)
   goals met: 0 of 4
6. (drive truck-1 city-1-loc-6 city-1-loc-5)
   deleted: (at truck-1 city-1-loc-6)
   added: (at truck-1 city-1-loc-5)
   goals met: 0 of 4
7. (pick-up truck-1 city-1-loc-5 package-3 capacity-1 capacity-2)
   deleted: (at package-3 city-1-loc-5) (capacity truck-1 capacity-2)
   added: (in package-3 truck-1) (capacity truck-1 capacity-1)
   goals met: 0 of 4
8. (drive truck-1 city-1-loc-5 city-1-loc-4)
   deleted: (at truck-1 city-1-loc-5)
   added: (at truck-1 city-1-loc-4)
   goals met: 0 of 4
9. (pick-up truck-1 city-1-loc-4 package-4 capacity-0 capacity-1)
   deleted: (at package-4 city-1-loc-4) (capacity truck-1 capacity-1)
   added: (in package-4 truck-1) (capacity truck-1 capacity-0)
   goals met: 0 of 4
10. (drive truck-1 city-1-loc-4 city-1-loc-1)
   deleted: (at truck-1 city-1-loc-4)
   added: (at truck-1 city-1-loc-1)
   goals met: 0 of 4
11. (drive truck-1 city-1-loc-1 city-1-loc-2)
   deleted: (at truck-1 city-1-loc-1)
   added: (at truck-1 city-1-loc-2)
   goals met: 0 of 4
12. (drive truck-1 city-1-loc-2 city-2-loc-6)
   deleted: (at truck-1 city-1-loc-2)
   added: (at truck-1 city-2-loc-6)
   goals met: 0 of 4
13. (drive truck-1 city-2-loc-6 city-2-loc-1)
   deleted: (at truck-1 city-2-loc-6)
   added: (at truck-1 city-2-loc-1)
   goals met: 0 of 4
14. (drop truck-1 city-2-loc-1 package-4 capacity-0 capacity-1)
   deleted: (in package-4 truck-1) (capacity truck-1 capacity-0)
   added: (at package-4 city-2-loc-1) (capacity truck-1 capacity-1)
   goals met: 1 of 4
15. (drive truck-1 city-2-loc-1 city-2-loc-2)
   deleted: (at truck-1 city-2-loc-1)
   added: (at truck-1 city-2-loc-2)
   goals met: 1 of 4
16. (drop truck-1 city-2-loc-2 package-3 capacity-1 capacity-2)
   deleted: (in package-3 truck-1) (capacity truck-1 capacity-1)
   added: (at package-3 city-2-loc-2) (capacity truck-1 capacity-2)
   goals met: 2 of 4
17. (drive truck-1 city-2-loc-2 city-2-loc-5)
   deleted: (at truck-1 city-2-loc-2)
   added: (at truck-1 city-2-loc-5)
   goals met: 2 of 4
18. (drop truck-1 city-2-loc-5 package-2 capacity-2 capacity-3)
   deleted: (in package-2 truck-1) (capacity truck-1 capacity-2)
   added: (at package-2 city-2-loc-5) (capacity truck-1 capacity-3)
   goals met: 3 of 4
19. (drive truck-1 city-2-loc-5 city-2-loc-4)
   deleted: (at truck-1 city-2-loc-5)
   added: (at truck-1 city-2-loc-4)
   goals met: 3 of 4
20. (drop truck-1 city-2-loc-4 package-1 capacity-3 capacity-4)
   deleted: (in package-1 truck-1) (capacity truck-1 capacity-3)
   added: (at package-1 city-2-loc-4) (capacity truck-1 capacity-4)
   goals met: 4 of 4
